<!doctype html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="/css/style.css">
    <title>Название статьи</title>
</head>
<body>
<header class="header">
    <div class="logo_wrapper">
        <h1><a href="/" class="logo">IT.blog</a></h1>
    </div>
    <!-- logo_wrapper -->
    <ul class="nav_list">
        <li class="active_nav_list_item">HTML & CSS</li>
        <li class="nav_list_item"><a href="/category.php">JavaScript</a></li>
        <li class="nav_list_item"><a href="/category.php">PHP</a></li>
        <li class="nav_list_item"><a href="#">О проекте</a></li>
        <li class="nav_list_item"><a href="#">Вход</a></li>
    </ul>
    <!-- nav_list -->
</header>
<main class="main_wrapper">
    <article class="article">
        <h2 class="sub_title">Название статьи</h2>
        <img src="/images/preview_image.jpg" alt="">
        <div class="content_article">
            Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики. Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку. Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу. Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка. Грустный риторический вопрос скатился по его щеке и он продолжил свой путь. По дороге встретил текст рукопись. Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну». Не послушавшись рукописи, наш текст продолжил свой путь. Вскоре ему повстречался коварный составитель <br><br>
            Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики. Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку. Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу. Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка. Грустный риторический вопрос скатился по его щеке и он продолжил свой путь. По дороге встретил текст рукопись. Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну». Не послушавшись рукописи, наш текст продолжил свой путь. Вскоре ему повстречался коварный составитель
        </div>
        <div class="author_time">
            <p class="author">Автор: Денис Скотаренко</p>
            <time datetime="10-12-2020">Дата публикации: 14.12.2020</time>
        </div>
    </article>
    <!-- article -->
    <section class="current_category">
        <h2 class="sub_title">Вам также может быть интересно</h2>
        <div class="current_article_wrapper">
            <article class="popular_article">
                <h3><a href="#">В лесу родилась елочка</a></h3>
                <a href="#">
                    <img src="/images/popular_article.jpg" alt="" width="304" height="176">
                </a>
                <p class="content">
                    Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я.
                </p>
            </article>
            <article class="popular_article">
                <h3><a href="#">CSS Grid помогает жить в 2020</a></h3>
                <a href="#">
                    <img src="/images/popular_article.jpg" alt="" width="304" height="176">
                </a>
                <p class="content">
                    Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я.
                </p>
            </article>
            <article class="popular_article">
                <h3><a href="#">Основы ООП в PHP часть 1</a></h3>
                <a href="#">
                    <img src="/images/popular_article.jpg" alt="" width="304" height="176">
                </a>
                <p class="content">
                    Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я.
                </p>
            </article>
        </div>
    </section>
    <!-- post_list -->
</main>
<!-- main_wrapper -->
<footer class="footer">
    <div class=" logo_wrapper_footer">
        <h1><a href="/" class="logo logo_footer">IT.blog</a></h1>
    </div>
    <section class="social">
        <h2 class="visually-hidden">Мы в социальных сетях</h2>
        <ul class="social_list">
            <li class="social_icon">
                <a href="#">Twitter</a>
            </li>
            <li class="social_icon">
                <a href="#">Facebook</a>
            </li>
            <li class="social_icon">
                <a href="#">Youtube</a>
            </li>
        </ul>
    </section>
    <div class="copyright">&copy; 2020 Denys Skotarenko</div>
</footer>
</body>
</html>